using System;

/// <summary>
/// Вложенность тернарной операции.
/// Какой координатной четверти принадлежит точка?
/// Определить четверть координатной плоскости, которой принадлежит точка. Координаты точки ввести с клавиатуры.
/// Считать кординаты с клвавиатуры и решить с помошью операторов конструкция if - else  и тернарного оператора.
/// 1 четверть - x > 0 и y > 0
/// 2 четверть - x < 0 и y > 0
/// 3 четверть - x < 0 и y < 0
/// 4 четверть - x > 0 и y < 0
/// </summary>

namespace Conditional_Lessons
{
    class Program
    {
        static void Main()
        {
            Console.WriteLine("Введите координату x");

            int x = Convert.ToInt32(Console.ReadLine());
           
            Console.WriteLine("Введите координату y");

            int y = Convert.ToInt32(Console.ReadLine());

            int coordinateQuarter = 0;

            /******************************************************************************************************/
            /*************************РЕАЛИЗАЦИЯ СПОМОШЬЮ ОПЕРАТОРОВ КОНСТРУКЦИИ IF - ELSE ************************/
            /******************************************************************************************************/

            if (x > 0 & y > 0)
                coordinateQuarter = 1;
            else if (x < 0 & y > 0)
                coordinateQuarter = 2;
            else if (x < 0 & y < 0)
                coordinateQuarter = 3;
            else if (x > 0 & y < 0)
                coordinateQuarter = 4;
            
            /******************************************************************************************************/
            /*************************РЕАЛИЗАЦИЯ СПОМОШЬЮ тернарной операции **************************************/
            /******************************************************************************************************/

            //coordinateQuarter = (x > 0 & y > 0) ? 1 : (x < 0 & y > 0)? 2: (x < 0 & y < 0)? 3: 4;

            Console.WriteLine(string.Format(@"Точка с координатами ({0};{1}) пренадлежит {2} - й четверти", x, y, coordinateQuarter));

            //Задержка
            Console.ReadKey();
        }
    }
}
